; domain
;Header and description

(define (domain clean-robot)

;import needed requirements
(:requirements :strips :negative-preconditions :typing)

;define types box and robot just for simplicity
(:types box - movable robot - movable office)

; There is always only one robot so it can be 
; defined as a constant
(:constants R - robot)

(:predicates
 (at ?B - movable ?o - office) ; The object B is at office o
 (adj ?o1 ?o2 - office) ; The offices o1 and o2 are adjacent
 (dirty ?o - office) ; The office o is dirty
 (empty ?o - office) ; There is no box at office o
)

(:action clean
    :parameters (?o - office)
    :precondition (and (at R ?o) ; The robot is at office o
                       (dirty ?o) ; The office o is dirty
                    )
    :effect (and (not (dirty ?o)) ; The office o is not dirty anymore
            )
)

(:action move
    :parameters (?o1 ?o2 - office)
    :precondition (and (adj ?o1 ?o2) ; Both offices are adjacent
                        (at R ?o1) ; The robot is at office o1
                   )
    :effect (and (not (at R ?o1)) ; The robot is not at office o1 anymore
                 (at R ?o2) ; The robot is now at office o2
            )
)

(:action push
    :parameters (?B - box ?o1 ?o2 - office)
    :precondition (and (at R ?o1) ; The robot is at office o1
                       (adj ?o1 ?o2) ; Both offices are adjacent
                       (at ?B ?o1) (empty ?o2) ; The box B is at o1 and o2 is empty
                   )
    :effect (and (at R ?o2) (not (at R ?o1)) ; Move the robot to o2
                 (at ?B ?o2) (not (at ?B ?o1)) ; Move the box to o2
                 (not (empty ?o2)) (empty ?o1) ; o2 is not empty anymore and o1 is empty
            )
)



;define actions here

)

; problem
(define (problem NCELL16) (:domain clean-robot)
(:objects
    o1 o2 o3 o4 o5 o6 o7 o8 o9 o10 o11 o12 o13 o14 o15 o16 - office ; Offices
    A B - box    ; Boxes
)

(:init

 ; Adjacency conditions
 (adj o1 o2) (adj o2 o1)
 (adj o1 o5) (adj o5 o1)

 (adj o2 o6) (adj o6 o2)
 (adj o2 o3) (adj o3 o2)

 (adj o3 o7) (adj o7 o3)
 (adj o3 o4) (adj o4 o3)

 (adj o4 o8) (adj o8 o4)

 (adj o5 o6) (adj o6 o5)
 (adj o5 o9) (adj o9 o5)

 (adj o9 o10) (adj o10 o9)
 (adj o9 o13) (adj o13 o9)

 (adj o10 o11) (adj o11 o10)
 (adj o10 o14) (adj o14 o10)
 
 (adj o11 o12) (adj o12 o11)
 (adj o11 o15) (adj o15 o11)

 (adj o12 o16) (adj o16 o12)

 (adj o13 o14) (adj o14 o13)
 (adj o14 o15) (adj o15 o14)

 (adj o15 o16) (adj o16 o15)

 ; Robot initial location
 (at R o13)

 ; Box initial locations map
 (at A o1)  (empty o2)  (empty o3)  (empty o4)
 (empty o5)  (empty o6)  (empty o7)  (empty o8)
 (empty o9)  (empty o10) (empty o11)  (empty o12)
 (empty o13) (empty o14) (empty o15) (at B o16)

 ; Dirty offices
 (dirty o3)
 (dirty o9)

)

(:goal (and
    ; Robot final location
    (at R o4)

    ; Clean offices
    (not (dirty o3))
    (not (dirty o9))


    ; Boxes final locations
    (at A o2) (at B o14)

))
)

; plan
1. (move o13 o9)
   deleted: (at r o13)
   added: (at r o9)
   goals met: 0 of 5
2. (clean o9)
   deleted: (dirty o9)
   goals met: 1 of 5
3. (move o9 o5)
   deleted: (at r o9)
   added: (at r o5)
   goals met: 1 of 5
4. (move o5 o1)
   deleted: (at r o5)
   added: (at r o1)
   goals met: 1 of 5
5. (push a o1 o2)
   deleted: (at r o1) (at a o1) (empty o2)
   added: (at r o2) (at a o2) (empty o1)
   goals met: 2 of 5
6. (move o2 o3)
   deleted: (at r o2)
   added: (at r o3)
   goals met: 2 of 5
7. (clean o3)
   deleted: (dirty o3)
   goals met: 3 of 5
8. (move o3 o2)
   deleted: (at r o3)
   added: (at r o2)
   goals met: 3 of 5
9. (move o2 o1)
   deleted: (at r o2)
   added: (at r o1)
   goals met: 3 of 5
10. (move o1 o5)
   deleted: (at r o1)
   added: (at r o5)
   goals met: 3 of 5
11. (move o5 o9)
   deleted: (at r o5)
   added: (at r o9)
   goals met: 3 of 5
12. (move o9 o10)
   deleted: (at r o9)
   added: (at r o10)
   goals met: 3 of 5
13. (move o10 o11)
   deleted: (at r o10)
   added: (at r o11)
   goals met: 3 of 5
14. (move o11 o12)
   deleted: (at r o11)
   added: (at r o12)
   goals met: 3 of 5
15. (move o12 o16)
   deleted: (at r o12)
   added: (at r o16)
   goals met: 3 of 5
16. (push b o16 o15)
   deleted: (at r o16) (at b o16) (empty o15)
   added: (at r o15) (at b o15) (empty o16)
   goals met: 3 of 5
17. (push b o15 o14)
   deleted: (at r o15) (at b o15) (empty o14)
   added: (at r o14) (at b o14) (empty o15)
   goals met: 4 of 5
18. (move o14 o13)
   deleted: (at r o14)
   added: (at r o13)
   goals met: 4 of 5
19. (move o13 o9)
   deleted: (at r o13)
   added: (at r o9)
   goals met: 4 of 5
20. (move o9 o5)
   deleted: (at r o9)
   added: (at r o5)
   goals met: 4 of 5
21. (move o5 o1)
   deleted: (at r o5)
   added: (at r o1)
   goals met: 4 of 5
22. (move o1 o2)
   deleted: (at r o1)
   added: (at r o2)
   goals met: 4 of 5
23. (move o2 o3)
   deleted: (at r o2)
   added: (at r o3)
   goals met: 4 of 5
24. (move o3 o4)
   deleted: (at r o3)
   added: (at r o4)
   goals met: 5 of 5
